/******************************************************************************
* タイトル  :
* ファイル名:acorn.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/10/27
*******************************************************************************
* 更新履歴:-2015/10/27 渡邉柚香
*           -v0.01 
******************************************************************************/

/******************************************************************************
* インクルード宣言
******************************************************************************/
/*多重インクルード防止*/
#ifndef _ACORN_H_
#define _ACORN_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
//#define FIELD_USE_TEX ( true )//テクスチャの有無
#define ACORN_ROT_SPEED (0.05f)//回転スピード
#define ACOUNT_ROTZ (0.1)//ｚ軸の傾き度
#define ACORN_RADIUS (10)//半径

#define ACORN_MOVEY (1.0)
#define ACORN_MOVE_ROT (0.2)

#define ACORN_EFFECT_TIME (2)//エフェクトを呼ぶ頻度

#define ACORN_MAX (80)//どんぐりの数

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	D3DXVECTOR3 posAcorn;
	D3DXVECTOR3 rotAcorn;
	D3DXVECTOR3 sclAcorn;

	float moveY;//クルクルの時のｙ
	float moveRot;//クルクルの時の回転角度

	int EffectTime;//エフェクトを呼ぶタイミング

	bool acornUse;//どんりに当たるかどうか
	bool acornDraw;//どんぐりを描画しているかどうか

}ACORN;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
void InitAcorn( void );
void UninitAcorn( void );
void UpdateAcorn( void );
void DrawAcorn( void );
void SetAcorn( D3DXVECTOR3 pos );
ACORN *GetAcorn( void );


/*多重インクルード防止*/
#endif