/******************************************************************************
* タイトル  :
* ファイル名:box.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2016/01/21
*******************************************************************************
* 更新履歴:-2016/01/21 渡邉柚香
*           -v0.01 
******************************************************************************/

/*多重インクルード防止*/
#ifndef _BOX_H_
#define _BOX_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define BOX_USE_TEX ( true )//テクスチャの有無
#define BOX_TEX_MAX (2) //テクスチャの枚数
#define BOX_SURFACE_MAX (6)//一個の箱の面の数
#define BOX_MAX (20)//箱の数

#define BOX_WIDTH (40)
#define BOX_HEIGHT (40)

//#define BOX_X (1)//xのブロック数
//#define BOX_Z (1)//zのブロック数
//
//#define BOX_NUM_INDEX ( ( BOX_X + 1.0 ) * 2.0 * BOX_Z + ( BOX_Z - 1.0 ) * 2.0 )//インデックス数
#define BOX_NUM_VTX (4)//頂点数
//#define BOX_NUM_PORIGON ( BOX_X * BOX_Z * 2.0 + 4.0 * ( BOX_Z - 1.0 ) )//ポリゴン数

/******************************************************************************
* 列挙型
******************************************************************************/
typedef enum
{
	BOX_NOMAL = 0,
	BOX_SPRING ,
	BOX_NONE

}BOXPATTARN;

/******************************************************************************
* 構造体
******************************************************************************/
typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffBox;//頂点バッファ

	D3DXVECTOR3 posBox;		//位置情報
	D3DXVECTOR3 rotBox;		//回転情報
	D3DXVECTOR3 sclBox;		//倍率情報

	D3DXVECTOR3 setPosBox;		//箱の中心点

	bool boxUse;		//使ってるかどうか
	bool boxSpringHit;		//playerが上でジャンプしたかどうじか
	BOXPATTARN boxPattarn;	//種類

}BOX;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitBox( void );
void UninitBox( void );
void UpdateBox( void );
void DrawBox( void );
void SetBox( D3DXVECTOR3 pos , BOXPATTARN boxPattarn );
BOX *GetBox( void );

/*多重インクルード防止*/
#endif