/******************************************************************************
* タイトル  :
* ファイル名:camera.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/10/23
*******************************************************************************
* 更新履歴:-2015/10/23 渡邉柚香
*           -v0.01 
******************************************************************************/

/******************************************************************************
* インクルード宣言
******************************************************************************/
/*多重インクルード防止*/
#ifndef _CAMERA_H_
#define _CAMERA_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define CAMERA_NEARZ (10)
#define CAMERA_FARZ (1000)

#define AMOUNT_MOVE (10.0f)//移動スピード
#define ROT_POSV_SPEED (0.005f)//回転スピード
#define ROT_POSR_SPEED (0.005f)//注視点回転スピード

#define DISTANTH_MODEL_FLONT (70)//カメラとモデルの距離(前に行く時)
#define DISTANTH_MODEL_BACK (20)//カメラとモデルの距離(後ろに行く時)

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	D3DXVECTOR3 posV;		//視点
	D3DXVECTOR3 posR;		//注視点
	D3DXVECTOR3 vecU;		//上方向べくトル
	D3DXMATRIX mtxProjection;//プロジェクションマトリックス
	D3DXMATRIX mtxView;		//ビューマトリックス

	D3DXVECTOR3 rot;	//カメラの回転角
	float length;			//モデルとの距離

	D3DXVECTOR3 posVMove;	//カメラ移動量
	D3DXVECTOR3 posRMove;	//注視点移動量
	D3DXVECTOR3 goalRot;

	float distanthModel;			//カメラとモデルの距離

	bool cameraDebug;	//カメラの座標表示有無

}CAMERA;


/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
void InitCamera( void );
void UninitCamera( void );
void UpdateCamera( void );
void DrawCamera( void );
void SetCamera( void );
CAMERA *GetCamera( void );


/*多重インクルード防止*/
#endif