/******************************************************************************
* タイトル  :
* ファイル名:input.h
* 作 者 名  :AT12C245 渡邉柚香
* 作 成 日  :2015/06/22
*******************************************************************************
* 更新履歴:-2015/06/22 渡邉柚香
*           -v0.01 
******************************************************************************/
/*多重インクルード防止*/
#ifndef _INPUT_H_
#define _INPUT_H_

/******************************************************************************
*インクルード宣言
******************************************************************************/
#include "main.h"

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitInput( HINSTANCE hInstance , HWND hwnd );
void UninitInput( void );
void UpdeteInput( void );
HRESULT InitKeyboard( HINSTANCE hInstance , HWND hwnd );
void UninitKeyboard( void );
void UpdateKeyboard( void );


bool GetKeyboardPress( int nkey );
bool GetKeyboardTrigger( int nkey );
bool GetKeyboardRelease( int nkey );

/*多重インクルード防止*/
#endif