/******************************************************************************
* タイトル  :
* ファイル名:acorncnt.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/06/22
*******************************************************************************
* 更新履歴:-2015/06/22 渡邉柚香
*           -v0.01 
******************************************************************************/
/*多重インクルード防止*/
#ifndef _LIFECNT_H_
#define _LIFECNT_H_

/******************************************************************************
*インクルード宣言
******************************************************************************/
#include "main.h"

/******************************************************************************
* マクロ定義
******************************************************************************/
#define LIFECNT_MAX (4)
#define LIFECNT_TEX_MAX (3)

#define LIFECNT_WIDTH  (40.0)		//ポリゴン横幅
#define LIFECNT_HEIGHT (60.0)		//ポリゴン縦幅
#define LIFECNT_TEX_WIDTH (50.0)	//ポリゴン同士の距離

#define LIFECNT_TEX_HEIGHT (40.0)		//たぬきポリゴン縦幅
#define LIFECNT_TEX_WIDTH  (40.0)		//たぬきポリゴン横幅

#define LIFECNT_KAKERU_HEIGHT (20.0)		//かけるポリゴン縦幅

#define LIFECNT_PATTERN_WIDTH (1.0f / 10 )		//１フレームの横幅

#define LIFECNT_DOWN_SPEED (30)		//表示する時のスピード
#define LIFECNT_UP_SPEED (-1)		//しまう時のスピード
#define LIFECNT_INDICATE_TIME (200)	//表示しておく時間
#define LIFECNT_POSY (40.0f)		//表示Ｙ座標

/******************************************************************************
* 列挙型
******************************************************************************/
typedef enum
{
	LIFE_NONE = 0,
	LIFE_DOWN,
	LIFE_IND,
	LIFE_UP

}LIFEIND;

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	D3DXVECTOR3 posLifeCnt;		//ポリゴンの中心点
	float widthLifeCnt;			//ポリゴン中心点からの横幅
	float heightLifeCnt;			//ポリゴン中心点からの縦幅
	float posTexXLifeCnt;			//テクスチャのポジション

	LIFEIND lifeInd;
	int cntIndTime;

}LIFECNT;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitLifeCnt( void );
void UninitLifeCnt( void );
void UpdateLifeCnt( void );
void DrawLifeCnt( void );
LIFECNT *GetLifeCnt( void );
void AddLifeCnt( int value );

#endif