/******************************************************************************
* タイトル  :
* ファイル名:field.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/10/23
*******************************************************************************
* 更新履歴:-2015/10/23 渡邉柚香
*           -v0.01 
******************************************************************************/

/******************************************************************************
* インクルード宣言
******************************************************************************/
/*多重インクルード防止*/
#ifndef _FIELD_H_
#define _FIELD_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define FIELD_USE_TEX ( true )							//テクスチャの有無
#define FIELD_TEX ( "data/TEXTURE/field004.jpg" )		//テクスチャ名前

#define FIELD_MAX (10)//床の数

#define FIELD_X (2)			//xのブロック数
#define FIELD_Z (2)			//zのブロック数
#define FIELD_WIDHT (200)	//1ブロックの横幅
#define FIELD_HEIGTH (200)	//1ブロックの縦幅

#define FIELD_NUM_INDEX ( ( FIELD_X + 1.0 ) * 2.0 * FIELD_Z + ( FIELD_Z - 1.0 ) * 2.0 )	//インデックス数
#define FIELD_NUM_VTX ( ( FIELD_X + 1.0 ) * ( FIELD_Z + 1.0 ) )							//頂点数
#define FIELD_NUM_PORIGON ( FIELD_X * FIELD_Z * 2.0 + 4.0 * ( FIELD_Z - 1.0 ) )			//ポリゴン数

/******************************************************************************
* 構造体
******************************************************************************/
typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffField;//頂点バッファ
	LPDIRECT3DINDEXBUFFER9 pIdxBuffField;//インデックスバッファ

	D3DXVECTOR3 posField;		//位置情報
	D3DXVECTOR3 rotField;		//回転情報
	D3DXVECTOR3 sclField;		//倍率情報

	bool useField;		//床を使ってるかどうか

}FIELD;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitField( void );
void UninitField( void );
void UpdateField( void );
void DrawField( void );
FIELD *GetField( void );
void SetField( D3DXVECTOR3 pos );


/*多重インクルード防止*/
#endif