/******************************************************************************
* タイトル  :
* ファイル名:model.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/10/27
*******************************************************************************
* 更新履歴:-2015/10/27 渡邉柚香
*           -v0.01 
******************************************************************************/

/******************************************************************************
* インクルード宣言
******************************************************************************/
/*多重インクルード防止*/
#ifndef _MODEL_H_
#define _MODEL_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
//#define FIELD_USE_TEX ( true )//テクスチャの有無
#define MODEL_RADIUS (20)
#define MODEL_MOVE_SPEED (4.0f)//移動スピード
#define MODEL_ROT_SPEED (0.05f)//回転スピード

#define JUMP_MOVE (14)//ジャンプ量
#define JUMP_GRAVITY (0.9)//重力

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	D3DXVECTOR3 posModel;
	D3DXVECTOR3 rotModel;
	D3DXVECTOR3 sclModel;

	D3DXVECTOR3 moveModel;		//移動量
	D3DXVECTOR3 goalRotModel;	//目標の角度

	bool useMove;		//コントローラーを使えるかどうか
	bool useJump;		//ジャンプをしているかどうか
	bool useGravity;	//重力を使用してるかどうか
	bool death;			//死亡したかどうか

	bool hitModel;		//壁の判定
}MODEL;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
void InitModel( void );
void UninitModel( void );
void UpdateModel( void );
void DrawModel( void );
MODEL *GetModel( void );
void HitBoxModel( void );
void HitObstaclModel( void );
void HitEnemyModel( void );


/*多重インクルード防止*/
#endif