/******************************************************************************
* タイトル  :
* ファイル名:pause.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/06/22
*******************************************************************************
* 更新履歴:-2015/06/22 渡邉柚香
*           -v0.01 
******************************************************************************/
/*多重インクルード防止*/
#ifndef _PAUSE_H_
#define _PAUSE_H_

/******************************************************************************
*インクルード宣言
******************************************************************************/
#include "main.h"

/******************************************************************************
* マクロ定義
******************************************************************************/
#define PAUSE_BG_NAME "data/TEXTURE/pause_bg.jpg"
#define PAUSE_TEX_MAX (4)

#define PAUSE_BG_WIDTH (300)
#define PAUSE_BG_HEIGHT (400)

#define PAUSE_LOGO1_WIDTH (300)
#define PAUSE_LOGO1_HEIGHT (100)

#define PAUSE_LOGO2_WIDTH (300)
#define PAUSE_LOGO2_HEIGHT (100)

#define PAUSE_LOGO3_WIDTH (300)
#define PAUSE_LOGO3_HEIGHT (100)

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffPause ;

	D3DXVECTOR3 pos;		//ポリゴンの中心点
	float width;			//ポリゴン中心点からの横幅
	float height;			//ポリゴン中心点からの縦幅

}PAUSE;

/******************************************************************************
* 列挙型
******************************************************************************/
typedef enum
{
	PAUSE_CONTINUE = 0,
	PAUSE_RETRY,
	PAUSE_QUIT,
	PAUSE_MAX,
}PAUSEPATTARN;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitPause( void );
void UninitPause( void );
void UpdatePause( void );
void DrawPause( void );
void SetPause( void );
bool GetPause( void );
void SetPause( bool pause );

#endif