/******************************************************************************
* タイトル  :
* ファイル名:select.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2016/02/01
*******************************************************************************
* 更新履歴:-2016/02/01 渡邉柚香
*           -v0.01 
******************************************************************************/
/*多重インクルード防止*/
#ifndef _SELECTARROW_H_
#define _SELECTARROW_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define SELECT_ARO_MAX (1)//オブジェクトの数

#define SELECT_ARO_WIDTH (100)//矢印の幅
#define SELECT_ARO_HEIDHT (100)

/******************************************************************************
*インクルード宣言
******************************************************************************/
#include "main.h"

typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffSelectAro;//頂点バッファ

	D3DXVECTOR3 posSelectAro;		//ポリゴンの中心点
	float widthSelectAro;			//ポリゴン中心点からの横幅
	float heightSelectAro;			//ポリゴン中心点からの縦幅

}SELECTARO;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitSelectAro( void );
void UninitSelectAro( void );
void UpdateSelectAro( void );
void DrawSelectAro( void );

#endif