/******************************************************************************
* タイトル  :
* ファイル名:select.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2016/02/01
*******************************************************************************
* 更新履歴:-2016/02/01 渡邉柚香
*           -v0.01 
******************************************************************************/
/*多重インクルード防止*/
#ifndef _SELECT_H_
#define _SELECT_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define SELECT_MAX (3)//オブジェクトの数

#define SELECT_STAGE_WIDTH (450)//ステージの画像の幅
#define SELECY_STAGE_HEIGHT (300)

#define SELECT_SPEED (100)	//選択時の移動量
#define SELECT_MOVE_MAX (SELECT_MAX - 1)	//左に動く種類
#define SELECT_MOVEY (0.05)		//ふわふわの移動量

#define SELECT_ARO_WIDTH (100)//矢印の幅
#define SELECT_ARO_HEIDHT (100)

/******************************************************************************
*インクルード宣言
******************************************************************************/
#include "main.h"

/******************************************************************************
* 構造体定義
******************************************************************************/

typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffSelect;//頂点バッファ

	D3DXVECTOR3 posSelect;		//ポリゴンの中心点
	float widthSelect;			//ポリゴン中心点からの横幅
	float heightSelect;			//ポリゴン中心点からの縦幅
	float moveY;				//Ｙの移動

	bool selectMove;			//セレクト時の移動量

	bool StageRelease;			//ステージを開放しているかどうか

}SELECT;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitSelect( void );
void UninitSelect( void );
void UpdateSelect( void );
void DrawSelect( void );
int GetSelectMode( void );
SELECT *GetSelect( void );

#endif