/******************************************************************************
* タイトル  :
* ファイル名:sky.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/10/23
*******************************************************************************
* 更新履歴:-2015/10/23 渡邉柚香
*           -v0.01 
******************************************************************************/

/******************************************************************************
* インクルード宣言
******************************************************************************/
/*多重インクルード防止*/
#ifndef _SKY_H_
#define _SKY_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define SKY_USE_TEX ( true )							//テクスチャの有無
#define SKY_TEX ( "data/TEXTURE/sky004.jpg" )		//テクスチャ名前

#define SKY_MAX (2)//床の数

#define SKY_X (2)			//xのブロック数
#define SKY_Z (2)			//zのブロック数
#define SKY_WIDHT (200)	//1ブロックの横幅
#define SKY_HEIGTH (200)	//1ブロックの縦幅

#define SKY_NUM_INDEX ( ( SKY_X + 1.0 ) * 2.0 * SKY_Z + ( SKY_Z - 1.0 ) * 2.0 )	//インデックス数
#define SKY_NUM_VTX ( ( SKY_X + 1.0 ) * ( SKY_Z + 1.0 ) )							//頂点数
#define SKY_NUM_PORIGON ( SKY_X * SKY_Z * 2.0 + 4.0 * ( SKY_Z - 1.0 ) )			//ポリゴン数

/******************************************************************************
* 構造体
******************************************************************************/
typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffSky;//頂点バッファ
	LPDIRECT3DINDEXBUFFER9 pIdxBuffSky;//インデックスバッファ

	D3DXVECTOR3 posSky;		//位置情報
	D3DXVECTOR3 rotSky;		//回転情報
	D3DXVECTOR3 sclSky;		//倍率情報

	bool useSky;		//床を使ってるかどうか

}SKY;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitSky( void );
void UninitSky( void );
void UpdateSky( void );
void DrawSky( void );
SKY *GetSky( void );
void SetSky( D3DXVECTOR3 pos );


/*多重インクルード防止*/
#endif