/******************************************************************************
* タイトル  :
* ファイル名:title.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/06/22
*******************************************************************************
* 更新履歴:-2015/06/22 渡邉柚香
*           -v0.01 
******************************************************************************/
/*多重インクルード防止*/
#ifndef _TITLE_H_
#define _TITLE_H_

/******************************************************************************
*インクルード宣言
******************************************************************************/
#include "main.h"

#define TITLE_TEX_MAX (6)//テクスチャの数

#define TITLE_LOGO1_WIDTH (10)//「ぽん」の大きさ
#define TITLE_LOGO1_HEIGHT (12)

#define TITLE_LOGO2_WIDTH (20)//「たぬき」のおおきさ
#define TITLE_LOGO2_HEIGHT (10)

#define TITLE_LOGO3_WIDTH (55)//ロゴのバックの大きさ
#define TITLE_LOGO3_HEIGHT (40)

#define TITLE_LOGO4_WIDTH (3.3)//葉っぱのおおきさ
#define TITLE_LOGO4_HEIGHT (3)

#define TITLE_LOGO5_WIDTH (20)//ボタンのロゴの大きさ
#define TITLE_LOGO5_HEIGHT (10)

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	D3DXVECTOR3 posTitle;		//位置情報
	D3DXVECTOR3 rotTitle;		//回転情報
	D3DXVECTOR3 sclTitle;		//倍率情報

}TITLE;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitTitle( void );
void UninitTitle( void );
void UpdateTitle( void );
void DrawTitle( void );

#endif