/******************************************************************************
* タイトル  :
* ファイル名:billboard.h
* 作 者 名  :AT12C245 42 渡邉柚香
* 作 成 日  :2015/11/17
*******************************************************************************
* 更新履歴:-2015/11/17 渡邉柚香
*           -v0.01 
******************************************************************************/

/******************************************************************************
* インクルード宣言
******************************************************************************/
/*多重インクルード防止*/
#ifndef _TREE_H_
#define _TREE_H_

/******************************************************************************
* マクロ定義
******************************************************************************/
#define TREE_USE_TEX ( true )//テクスチャの有無
#define TREE_WIDTH (100)
#define TREE_HEIGHT (150)
#define TRE_DISTAICE (100)

#define TREE_X (1)//xのブロック数
#define TREE_Z (1)//zのブロック数

#define TREE_MAX (20)//木の使う数

#define TREE_NUM_INDEX ( ( TREE_X + 1.0 ) * 2.0 * TREE_Z + ( TREE_Z - 1.0 ) * 2.0 )//インデックス数
#define TREE_NUM_VTX ( ( TREE_X + 1.0 ) * ( TREE_Z + 1.0 ) )//頂点数
#define TREE_NUM_PORIGON ( TREE_X * TREE_Z * 2.0 + 4.0 * ( TREE_Z - 1.0 ) )//ポリゴン数

/******************************************************************************
* 構造体定義
******************************************************************************/
typedef struct
{
	D3DXVECTOR3 posTree;		//位置情報
	D3DXVECTOR3 rotTree;		//回転情報
	D3DXVECTOR3 sclTree;		//倍率情報

}TREE;

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/
HRESULT InitTree( void );
void UninitTree( void );
void UpdateTree( void );
void DrawTree( void );

/*多重インクルード防止*/
#endif